Coding/Python/dict.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>dict</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="dict"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-14 09:04:48 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#python">主页</a></div>


</head>
<body>


<div id="content">
<h1 class="title">dict</h1>


<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 初始化</a></li>
<li><a href="#sec-2">2 字典视图和几何</a></li>
<li><a href="#sec-3">3 排序字典键</a>
<ul>
<li><a href="#sec-3-1">3.1 sort:</a></li>
<li><a href="#sec-3-2">3.2 sorted:</a></li>
<li><a href="#sec-3-3">3.3 注意</a></li>
</ul>
</li>
<li><a href="#sec-4">4 常用函数</a>
<ul>
<li><a href="#sec-4-1">4.1 get()</a></li>
<li><a href="#sec-4-2">4.2 pop()</a></li>
<li><a href="#sec-4-3">4.3 udpate()</a></li>
<li><a href="#sec-4-4">4.4 del()</a></li>
<li><a href="#sec-4-5">4.5 clear()</a></li>
<li><a href="#sec-4-6">4.6 copy()</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 初始化</h2>
<div class="outline-text-2" id="text-1">




<pre class="example">
&gt;&gt;&gt; d = dict(name='visaya', age=20)

&gt;&gt;&gt; d = dict(zip(['name', 'age'], ['visaya', 20]))

#dict.fromkeys(listkeys, default=0) 把listkeys中的元素作为key均赋值为value，默认为0
&gt;&gt;&gt; d = dict.fromkeys(['a', 'b'], 1)
&gt;&gt;&gt; d
{'a': 1, 'b': 1}
</pre>



</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 字典视图和几何</h2>
<div class="outline-text-2" id="text-2">




<pre class="example">dict.keys()类似信使可以进行交集和并集等集合操作（类似集合，因为不存在重复的项），但dict.values()不可以进行如上操作。

&gt;&gt;&gt; k = d.keys()
&gt;&gt;&gt; k
dict_keys(['a', 'b'])
&gt;&gt;&gt; list(k)
['a', 'b']
&gt;&gt;&gt; k | {'x': 3}
{'a', 'x', 'b'}
&gt;&gt;&gt; k | {'x'}
{'a', 'x', 'b'}
&gt;&gt;&gt; k | {'x', 'y'}
{'a', 'y', 'b', 'x'}
&gt;&gt;&gt; k &amp; {'x'}
set()
&gt;&gt;&gt; v = d.values()
&gt;&gt;&gt; v
dict_values([1, 2])
&gt;&gt;&gt; v | {'x'}
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
TypeError: unsupported operand type(s) for |: 'dict_values' and 'set'
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 排序字典键</h2>
<div class="outline-text-2" id="text-3">

<p>两种方法:
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> sort:</h3>
<div class="outline-text-3" id="text-3-1">




<pre class="example">&gt;&gt;&gt; Ks = list(d.keys())
&gt;&gt;&gt; Ks.sort()
&gt;&gt;&gt; for k in Ks:
...     print(k, d[k])
... 
a 1
b 2
</pre>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> sorted:</h3>
<div class="outline-text-3" id="text-3-2">




<pre class="example">&gt;&gt;&gt; for k in sorted(d.keys()):
...     print(k, d[k])
... 
a 1
b 2

</pre>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 注意</h3>
<div class="outline-text-3" id="text-3-3">




<pre class="example">&gt;&gt;&gt; for k in list(d.keys()).sort():
...     print(k, d[k])
... 
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
TypeError: 'NoneType' object is not iterable

出错原因：
list.sort() list.append()函数都是对自身的操作，没有返回值，故需先将list(d.keys())的结果保存下来，在结果上进行sort()
</pre>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 常用函数</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> get()</h3>
<div class="outline-text-3" id="text-4-1">




<pre class="example">D.get(k[, d])   =&gt; D[k] if k in D else d. d defaults to none.
</pre>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> pop()</h3>
<div class="outline-text-3" id="text-4-2">




<pre class="example">D.pop(value[, d])   =&gt; Remove specified key and return the corresponding value. If key is not found, d is returned if given, otherwise KeyError is raised.
</pre>


</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> udpate()</h3>
<div class="outline-text-3" id="text-4-3">




<pre class="example">    D.update(E, **F) -&gt; None.  Update D from dict/iterable E and F.
    If E has a .keys() method, does:     for k in E: D[k] = E[k]
    If E lacks .keys() method, does:     for (k, v) in E: D[k] = v
    In either case, this is followed by: for k in F: D[k] = F[k]

&gt;&gt;&gt; d = dict(name='visaya', age=21)
&gt;&gt;&gt; d1= {'age': 20, 'sex': 'male'}
&gt;&gt;&gt; d2 = zip(['a', 'b'], [1, 2])

&gt;&gt;&gt; d.update(d1)
&gt;&gt;&gt; d
{'age': 20, 'name': 'visaya', 'sex': 'male'}
#for k in d1: d[k] = d1[k]

&gt;&gt;&gt; d.update(d2)
&gt;&gt;&gt; d
{'age': 20, 'name': 'visaya', 'sex': 'male'}
#for (k, v) in d2: d[k] = v
</pre>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> del()</h3>
<div class="outline-text-3" id="text-4-4">




<pre class="example">del D[key]
</pre>

</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> clear()</h3>
<div class="outline-text-3" id="text-4-5">

</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> copy()</h3>
<div class="outline-text-3" id="text-4-6">


<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</div>
</div>
</div>
</div>

</body>
</html>
